taylortrimble/pic18usb/USBFramework.c
rom const unsigned char _USBDeviceStringDescriptor[] = {
    0x44,               // bLength
    STRING,             // bDescriptorType
    'E', 0x00, 'N', 0x00, 'G', 0x00, 'R', 0x00, ' ', 0x00, '2', 0x00, '2', 0x00, '1', 0x00, '0', 0x00, ' ', 0x00,
    'P', 0x00, 'I', 0x00, 'C', 0x00, '1', 0x00, '8', 0x00, 'F', 0x00, '2', 0x00, '4', 0x00, '5', 0x00, '5', 0x00, ' ', 0x00,
    'U', 0x00, 'S', 0x00, 'B', 0x00, ' ', 0x00,
    'F', 0x00, 'i', 0x00, 'r', 0x00, 'm', 0x00, 'w', 0x00, 'a', 0x00, 'r', 0x00, 'e', 0x00
};

rom const rom const unsigned char *_USBStringDescriptors[] = {
    _USBLangIDStringDescriptor,
    _USBManufacturerStringDescriptor,
    _USBDeviceStringDescriptor
};

#pragma code
void _USBHandleControlError(void);
void _USBResetEP0InBuffer(void);
void _USBWriteValue(unsigned value, unsigned char bytes);
void _USBSendDescriptor(void);
void _USBWriteDescriptor(rom const unsigned char *descriptor, unsigned char bytes);
void _USBWriteSingleDescriptor(rom const unsigned char *descriptor);
void _USBProcessEP0(void);
void InitUSB(void);
void ServiceUSB(void);

void _USBHandleControlError(void)
{
    // Reset EP0 OUT buffer capacity
    _USBBD0O.count = EP0_SIZE;

    // Stall endpoint 0
    _USBBD0O.status = (UOWN|BSTALL);
    _USBBD0I.status = (UOWN|BSTALL);
}

void _USBResetEP0InBuffer(void)
{
    _USBBD0I.count = 0;                    // Not sending a byte
    _USBBD0I.status = (UOWN|DTS|DTSEN);    // Set UOWN, send byte as DATA1
}

void _USBWriteValue(unsigned value, unsigned char bytes)
{
    unsigned char index;

    // Copy value to EP0 IN buffer 8bits at a time
    for (index = 0; index < bytes; index++) {
        _USBBD0I.address[index] = (value>>(index*8))&0x00FF;
    }

    // Return data to SIE through buffer descriptor
    _USBBD0I.count = bytes;
    _USBBD0I.status = (UOWN|DTS|DTSEN);    // Set UOWN, send as DATA1
}

void _USBSendDescriptor(void)
{
    unsigned char index;

    if (_USBDescriptorBytesLeft <= EP0_SIZE) {
        // Copy remaining bytes to EP0 IN buffer
        for (index = 0; index < _USBDescriptorBytesLeft; index++) {
            _USBBD0I.address[index] = *_USBDescriptorToSend++;
        }

        // Return data to SIE through buffer descriptor
        _USBBD0I.count = _USBDescriptorBytesLeft;
        _USBBD0I.status = _USBBD0I.status^DTS;                // Toggle the DATAx bit
        _USBBD0I.status = (_USBBD0I.status&DTS)|(UOWN|DTSEN); // Preserve DATAx, clear rest, set UOWN and DTSEN

        // Not sending a descriptor any more
        _USBEngineStatus &= ~USBEngineStatusSendingDescriptor;
        _USBDescriptorBytesLeft = 0;
    } else {
        // Copy a full length of bytes to EP0 IN buffer
        for (index = 0; index < EP0_SIZE; index++) {
            _USBBD0I.address[index] = *_USBDescriptorToSend++;
        }

        // Return data to SIE through buffer descriptor
        _USBBD0I.count = EP0_SIZE;
        _USBBD0I.status = _USBBD0I.status^DTS;                // Toggle the DATAx bit
        _USBBD0I.status = (_USBBD0I.status&DTS)|(UOWN|DTSEN); // Preserve DATAx, clear rest, set UOWN and DTSEN

        // Inform IN token processing to keep sending descriptor
        _USBEngineStatus |= USBEngineStatusSendingDescriptor;
        _USBDescriptorBytesLeft -= EP0_SIZE;
    }
}

void _USBWriteDescriptor(rom const unsigned char *descriptor, unsigned char bytes)
{
    // Simply setup system for global descriptor-sending function
    _USBDescriptorToSend = descriptor;
    _USBDescriptorBytesLeft = bytes;

    // Call the function that sends the first set of EP0_SIZE bytes
    _USBSendDescriptor();
}

void _USBWriteSingleDescriptor(rom const unsigned char *descriptor)
{
    _USBWriteDescriptor(descriptor, descriptor[bLength_OFFSET]);
}

void _USBProcessEP0(void)
{
    unsigned char *UEP;
    unsigned char n;
    USBBufferDescriptor *currentBufferDescriptor;

    unsigned char *transactionData;
    USBToken transactionToken;
    unsigned char bRequest;
    unsigned char bmRequestType;
    unsigned wValue;
    unsigned wIndex;

    transactionData = gCurrentBufferDescriptor.address;
    transactionToken = (gCurrentBufferDescriptor.status&0x3C)>>2;

    switch (transactionToken) {  // extract PID bits
        case USBTokenSETUP:
            // SETUP token processing
            bRequest = transactionData[bRequest_OFFSET];
            bmRequestType = transactionData[bmRequestType_OFFSET];
            wValue = transactionData[wValueL_OFFSET] + (transactionData[wValueH_OFFSET])*0x100;
            wIndex = transactionData[wIndexL_OFFSET] + (transactionData[wIndexH_OFFSET])*0x100;
            
            // Reset OUT endpoint, dequeue any IN packets, and re-enable packet transfers
            _USBBD0O.status = ((!(bmRequestType&HOST_TO_DEVICE)&&wValue) ? (UOWN|DTS|DTSEN) : (UOWN|DTSEN)); // Choose correct DATA0/DATA1
            _USBBD0O.count = EP0_SIZE;
            _USBBD0I.status = DTSEN;   // steal UOWN to dequeue IN packets
            UCONbits.PKTDIS = 0;
            _USBEngineStatus = USBEngineStatusReset;
            
            // Move more up after testing/commit. The above is a combination of my code and Brad Minch's.
            switch (bRequest) {
                case GET_STATUS:
                    switch (bmRequestType) {
                        case USB_DEVICE_REQUEST:
                            _USBWriteValue(_USBDeviceStatus, 2);
                            break;

                        case USB_INTERFACE_REQUEST:
                            if ((_USBDeviceState == USBDeviceStateConfigured) && (wIndex<NUMBER_OF_USB_INTERFACES)) {
                                _USBWriteValue(0, 2);   // Always 0
                            } else {
                                _USBHandleControlError();
                            }
                            break;

                        case USB_ENDPOINT_REQUEST:
                            // Caluculate buffer descriptor status register and move BSTALL bit to bit <0>
                            if (_USBDeviceState == USBDeviceStateAddressed) {
                                _USBWriteValue((*(unsigned char *)(0x200+((wIndex&0x000F)*0x08)+((wIndex&0x0080)*0x04))&BSTALL)>>2, 2);
                            } else if (_USBDeviceState == USBDeviceStateConfigured) {
                                if (*(&UEP0+(wIndex&0x000F)) & (wIndex&0x80?EPINEN:EPOUTEN)) {  // If endpoint is enabled in specified directiong
                                    _USBWriteValue((*(unsigned char *)(0x200+((wIndex&0x000F)*0x08)+((wIndex&0x0080)*0x04))&BSTALL)>>2, 2);
                                } else {
                                    _USBResetEP0InBuffer();
                                }
                            } else {
                                _USBResetEP0InBuffer();
                            }
                            break;

                        default:
                            _USBHandleControlError();
                            break;
                    }
                    break;
                case CLEAR_FEATURE:
                case SET_FEATURE:
                    switch (bmRequestType&0x1F) {  // extract request recipient bits
                        case RECIPIENT_DEVICE:
                            switch (wValue & 0x00FF) {
                                case DEVICE_REMOTE_WAKEUP:
                                    if (bRequest == CLEAR_FEATURE)
                                        _USBDeviceStatus &= 0xFE;
                                    else
                                        _USBDeviceStatus |= 0x01;
                                    _USBBD0I.count = 0x00;      // set EP0 IN byte count to 0
                                    _USBBD0I.status = 0xC8;     // send packet as DATA1, set UOWN bit
                                    break;
                                default:
                                    _USBHandleControlError();    // set Request Error Flag
                            }
                            break;
                        case RECIPIENT_ENDPOINT:
                            switch (_USBDeviceState) {
                                case USBDeviceStateAddressed:
                                    if (!(wIndex & 0x0F)) {  // get EP, strip off direction bit, and see if its EP0
                                        _USBBD0I.count = 0x00;      // set EP0 IN byte count to 0
                                        _USBBD0I.status = 0xC8;     // send packet as DATA1, set UOWN bit
                                    } else {
                                        _USBHandleControlError();    // set Request Error Flag
                                    }
                                    break;
                                case USBDeviceStateConfigured:
                                    UEP = (unsigned char *)&UEP0;
                                    if (n = wIndex & 0x0F) { // get EP and strip off direction bit for offset from UEP0, if not EP0...
                                        currentBufferDescriptor = &_USBBD0O+((n<<1)|(((wIndex&0x00FF)&0x80) ? 0x01:0x00)); // compute pointer to the buffer descriptor for the specified EP
                                        if ((wIndex&0x00FF)&0x80) { // if the specified EP direction is IN...
                                            if (UEP[n]&0x02) {  // if EPn is enabled for IN transfers...
                                                currentBufferDescriptor->status = (bRequest==CLEAR_FEATURE) ? 0x00:0x84;
                                            } else {
                                                _USBHandleControlError();    // set Request Error Flag
                                            }
                                        } else {    // ...otherwise the specified EP direction is OUT, so...
                                            if (UEP[n]&0x04) {  // if EPn is enabled for OUT transfers...
                                                currentBufferDescriptor->status = (bRequest == CLEAR_FEATURE) ? 0x88:0x84;
                                            } else {
                                                _USBHandleControlError();    // set Request Error Flag
                                            }
                                        }
                                    }
                                    break;
                                default:
                                    _USBHandleControlError();    // set Request Error Flag
                            }
                            break;
                        default:
                            _USBHandleControlError();    // set Request Error Flag
                    }
                    break;
                case SET_ADDRESS:
                    if ((wValue&0x00FF)>0x7F) { // if new device address is illegal, send Request Error
                        _USBHandleControlError();    // set Request Error Flag
                    } else {
                        _USBEngineStatus |= USBEngineStatusAddressing;  // processing a SET_ADDRESS request
                        _USBPendingDeviceAddress = (wValue&0x00FF);  // save new address
                        _USBBD0I.count = 0x00;      // set EP0 IN byte count to 0
                        _USBBD0I.status = 0xC8;     // send packet as DATA1, set UOWN bit
                    }
                    break;
                case GET_DESCRIPTOR:
                    _USBEngineStatus |= USBEngineStatusSendingDescriptor;   // readying a GET_DESCRIPTOR request
                    switch ((wValue>>8)&0x00FF) {       // High byte indicates which type of descriptor to return
                        case DEVICE:
                            _USBWriteSingleDescriptor(_USBDeviceDescriptor);
                            break;
                        case CONFIGURATION:
                            switch (wValue & 0x00FF) {
                                case 0:
                                    _USBWriteDescriptor(_USBConfigurationDescriptors[0], (_USBConfigurationDescriptors[0])[2]+0x100*(_USBConfigurationDescriptors[0])[3]);
                                    break;
                                default:
                                    _USBHandleControlError();    // set Request Error Flag
                            }
                            break;
                        case STRING:
                            _USBWriteSingleDescriptor(_USBStringDescriptors[wValue]);
                            break;
                        default:
                            _USBHandleControlError();    // set Request Error Flag
                    }
                    break;
                case GET_CONFIGURATION:
                    _USBBD0I.address[0] = gCurrentConfiguration;  // copy current device configuration to EP0 IN buffer
                    _USBBD0I.count = 0x01;
                    _USBBD0I.status = 0xC8;     // send packet as DATA1, set UOWN bit
                    break;
                case SET_CONFIGURATION:
                    if ((wValue&0x00FF)<=NUM_CONFIGURATIONS) {
                        UEP1 = 0x00;    // clear all EP control registers except for EP0 to disable EP1-EP15 prior to setting configuration
                        UEP2 = 0x00;
                        UEP3 = 0x00;
                        UEP4 = 0x00;
                        UEP5 = 0x00;
                        UEP6 = 0x00;
                        UEP7 = 0x00;
                        switch (gCurrentConfiguration = (wValue&0x00FF)) {
                            case 0:
                                _USBDeviceState = USBDeviceStateAddressed;
#ifdef SHOW_ENUM_STATUS
                                LATC &= 0xE0;
                                LATCbits.LATC2 = 1;
#endif
                                break;
                            default:
                                _USBDeviceState = USBDeviceStateConfigured;
#ifdef SHOW_ENUM_STATUS
                                LATC &= 0xE0;
                                LATCbits.LATC3 = 1;
#endif
                        }
                        _USBBD0I.count = 0x00;      // set EP0 IN byte count to 0
                        _USBBD0I.status = 0xC8;     // send packet as DATA1, set UOWN bit
                    } else {
                        _USBHandleControlError();    // set Request Error Flag
                    }
                    break;
                case GET_INTERFACE:
                    switch (_USBDeviceState) {
                        case USBDeviceStateConfigured:
                            if ((wIndex&0x00FF)<NUM_INTERFACES) {
                                _USBBD0I.address[0] = 0x00; // always send back 0 for bAlternateSetting
                                _USBBD0I.count = 0x01;
                                _USBBD0I.status = 0xC8;     // send packet as DATA1, set UOWN bit
                            } else {
                                _USBHandleControlError();    // set Request Error Flag
                            }
                            break;
                        default:
                            _USBHandleControlError();    // set Request Error Flag
                    }
                    break;
                case SET_INTERFACE:
                    switch (_USBDeviceState) {
                        case USBDeviceStateConfigured:
                            if ((wIndex&0x00FF)<NUM_INTERFACES) {
                                switch ((wValue&0x00FF)) {
                                    case 0:     // currently support only bAlternateSetting of 0
                                        _USBBD0I.count = 0x00;      // set EP0 IN byte count to 0
                                        _USBBD0I.status = 0xC8;     // send packet as DATA1, set UOWN bit
                                        break;
                                    default:
                                        _USBHandleControlError();    // set Request Error Flag
                                }
                            } else {
                                _USBHandleControlError();    // set Request Error Flag
                            }
                            break;
                        default:
                            _USBHandleControlError();    // set Request Error Flag
                    }
                    break;
                case SET_DESCRIPTOR:
                case SYNCH_FRAME:
                default:
                    _USBHandleControlError();    // set Request Error Flag
            }
            break;
        case USBTokenIN:
            // A pending USB address is committed on an IN token
            if (_USBEngineStatus & USBEngineStatusAddressing) {
                UADDR = _USBPendingDeviceAddress;
                switch (UADDR) {
                    case 0:
                        _USBDeviceState |= USBDeviceStateInitialized;
                        UPDATE_ENUM_STATUS(_USBDeviceState);
                        break;
                        
                    default:
                        _USBDeviceState = USBDeviceStateAddressed;
                        UPDATE_ENUM_STATUS(_USBDeviceState);
                        break;
                }
                _USBEngineStatus &= ~USBEngineStatusAddressing;
            }
            
            // Continue sending any unfinished descriptor transmission
            else if (_USBEngineStatus & USBEngineStatusSendingDescriptor) {
                _USBSendDescriptor();
            }
            break;
        case USBTokenOUT:
            // Any OUT token means no more IN tokens are necessary
            _USBResetEP0InBuffer();
            
